{"0":"Not all ski trail has nine feet of snow on the ground.","1":"If there is a ski trail, there must be nine feet of snow on the ground.","2":"Not all ski trail has nine feet of snow on the ground."}
{"0":"The bicyclers are waiting because they aren't racing.","1":"The bicyclers are waiting because they are about to race.","2":"The bicyclers may not be about to race, they may be waiting for the race to begin."}
{"0":"The two men in the park play Frisbee, which is a type of game.","1":"If the two men are playing Frisbee in the park, they are playing Frisbee.","2":"Just because two men play Frisbee in the park does not mean it is a frisbee golf match with a friend."}
{"0":"We have no idea if the dogs are puppies, they could be any age dogs.","1":"If the dogs are puppies then they are young, which means they can be in a field playing.","2":"We have no idea if the dogs are puppies, they could be any age dogs."}
{"0":"There can be either a man or a group of people.","1":"There is a man speaking into a microphone which implies there is a group of people singing on stage.","2":"There may be a group of people singing on stage, but we don't know that for sure."}
{"0":"If the child is looking at the camera then she wasn't holding it therefore she couldn't take the picture","1":"If the child is looking at the camera then she was facing it, therefore close enough to use it.","2":"If the child is looking at the camera then she wasn't holding it therefore she couldn't take the picture"}
{"0":"The two people can't be discussing robbing a bank in public outside their van.","1":"The two people can be discussing anything, including robbing a bank and using their van as the get-away vehicle.","2":"The two people can't be discussing robbing a bank in public outside their van."}
{"0":"A department store has different types of ducks than a display in a mall has.","1":"A department store has rubber ducks for sale.","2":"You can not infer it is a department store."}
{"0":"A woman holding a baby does not imply they are on a chair.","1":"A woman holding a baby means they are near each other.","2":"Just because a woman holds the baby does not mean they are related or strangers."}
{"0":"A truck does not have to be large.","1":"A truck can be used to transport things.","2":"A truck does not have to be large."}
{"0":"People don't get trophies for losing.","1":"People don't get trophies for losing.","2":"People don't get trophies for losing."}
{"0":"A boy playing with a camera does not imply it is his.","1":"A boy playing with a camera means that he has a camera.","2":"A boy playing with a camera does not have a camera."}
{"0":"An elderly man can be seen smoking a cigarette, but it's unclear if it is currently happening.","1":"An elderly man can be seen smoking a cigarette.","2":"An elderly man can be seen smoking a cigarette, but it isn't certain."}
{"0":"The females can't be enjoying a meal at the same time as they play tennis.","1":"The females can be seen enjoying a meal at a restaurant because they are seen playing tennis, which involves eating at a restaurant.","2":"The females playing tennis may or may not be enjoying a meal at a restaurant."}
{"0":"Student need not be a woman. Purple wall need not be painted with a school logo","1":"Student need not be a woman. Purple wall need not be painted with a school logo","2":"Student need not be a woman. Purple wall need not be painted with a school logo"}
{"0":"The woman can be seen casting her lure but it isn't her last for the day.","1":"The woman can't be casting her last lure for the day if it is sunset, which means it is near the end of the day.","2":"The woman might not be casting her last lure for the day, it may be her first."}
{"0":"Not all people observing a trick are necessarily the skater's friends.","1":"The boy is performing the trick for his friends.","2":"Not all people observing a trick are necessarily the skater's friends."}
{"0":"Writing on a desk and playing piano cannot be done simultaneously.","1":"Writing on a desk and playing piano cannot be done simultaneously.","2":"Writing on a desk and playing piano cannot be done simultaneously."}
{"0":"Boy and dogs are different.","1":"Boy and dogs are different.","2":"Boy and dogs are different."}
{"0":"Laughing and crying are different things.","1":"Laughing and crying are different ways of expressing emotion.","2":"Laughing and crying are different things."}
{"0":"You cannot put peanut butter on bread, it has to be on bread.","1":"You cannot make a peanut butter and banana sandwich using peanut butter and bread, you need peanut butter and banana.","2":"Just because you are putting peanut butter on bread does not mean it is for a peanut butter and banana sandwich."}
{"0":"A string cannot support an elephant.","1":"A string cannot support an elephant, which means there can be no elephant in the box.","2":"A string cannot support an elephant."}
{"0":"Subdue does not imply to rope.","1":"Subdue means to restrain, which is what one does to a bull.","2":"Subdue does not imply to rope."}
{"0":"A girl cannot be an old man and playing a mobile game doesn't involve reading a device.","1":"A girl can be playing a mobile game.","2":"A girl cannot be an old man and playing a mobile game doesn't involve reading a device."}
{"0":"Men standing around does not imply at a soccer game.","1":"Men standing around means they are not sitting, therefore they can be standing or walking. They are therefore either at a soccer game or outside.","2":"Men standing around does not imply at a soccer game."}
{"0":"A street merchant is on the street, a grocery store is enclosed off the street.","1":"A street merchant is on the street, a grocery store is enclosed off the street.","2":"A street merchant is on the street, a grocery store is enclosed off the street."}
{"0":"A man at a funeral cannot be taking pictures.","1":"A man at a funeral would be taking pictures.","2":"A man at a funeral cannot be taking pictures."}
{"0":"Two men standing at a party cannot be a pair of brothers attending a party for their mother.","1":"Two men standing at a party may be brothers and may be attending a party for their mother.","2":"Two men standing at a party may or may not be brothers and may or may not be attending a party for their mother."}
{"0":"There is no way to know it is two people.","1":"There is a man sitting in a red chair with another man, which is two people.","2":"There is a man sitting in a red chair with another man, which is two people."}
{"0":"A deck outside is outdoors.","1":"A deck outside is outdoors.","2":"A deck outside does not necessarily mean outdoors."}
{"0":"Digs into the sand is different than playing in the sand.","1":"Digs into the sand is a way of saying playing in the sand.","2":"Digs into the sand is a way of saying playing in the sand, but it isn't specific to playing in the sand with a shovel."}
{"0":"Going over a jump is different than jumping a dirt ramp.","1":"Going over jump is way to rephrase jumping dirt ramps.","2":"Going over jump is a way of saying jumping a dirt ramp."}
{"0":"The people can be standing in front of a wall, but they don't have to be.","1":"They are in front a wall, so they can be in front of a wall covered in street art.","2":"The people may be in front of a wall, but it isn't stated."}
{"0":"One cannot be taking a nap and sleeping simultaneously.","1":"One can take a nap in a park, therefore people in the park can be sleeping.","2":"People taking a nap in the park may or may not be sleeping on benches."}
{"0":"One cannot be hiking and be near simultaneously.","1":"You cannot be on a mountain and hiking.","2":"You cannot infer it is a man and his friend hiking."}
{"0":"The man is wearing a white shirt or a blue, cannot specify both.","1":"The man wearing a white shirt is crossing a bridge in front of a stucco colored building, which implies it is not raining.","2":"The man wearing a white shirt may be wearing a blue shirt."}
{"0":"Riding a wave means one is outside, but one cannot ride a big wave, it is too big.","1":"Riding a wave means one is outside.","2":"Riding a wave means one is outside, but one does not need to be outside to be riding a wave."}
{"0":"While a big smile indicates one is happy, it does not imply it.","1":"The guy is smiling, which means he is probably happy.","2":"While a guy who is smiling may be happy, we do not know for sure."}
{"0":"A young boy climbing a tree does so in grassy hills, therefore it cannot be an oak tree.","1":"A young boy climbing a tree therefore must be a young boy climbing an oak tree.","2":"A young boy climbing a tree does,'t imply it is an oak tree"}
{"0":"The two elderly men are reading to the crowd, therefore they are not in front of the crowd.","1":"They are reading to the crowd, therefore they must be in front of the crowd.","2":"The two elderly men can be in front of the crowd or elsewhere."}
{"0":"Men is plural, which would mean a group.  Frisbee is a type of game.","1":"Men is plural, which would mean a group.  Frisbee is a type of game.","2":"Men is plural, which would mean a group.  Frisbee is a type of game."}
{"0":"Use an umbrella when it's raining, therefore it can't be raining.","1":"Use an umbrella when it's raining.","2":"Use an umbrella when it's raining, don't use an umbrella when it's raining."}
{"0":"If the view was from between buses, the woman therefore must be outside the buses' view.","1":"If the view was from between buses, the woman therefore must be near the buses.","2":"Whether the view was from between buses or near buses does not matter."}
{"0":"If the dog is running through the forest, it is running outdoors.","1":"If the dog is running through the forest, it must be outdoors.","2":"Running outdoors is one way to do it, but it isn't the only way."}
{"0":"The two people on the grassy plain aren't a skydiver and an instructor. They're a skydiver's helper and the skydiver.","1":"The two people on the grassy plain are a skydiver and the instructor.","2":"The two people on the grassy plain aren't necessarily a skydiver and an instructor. It's possible they are a skydiver's helpers or it's also possible they are playing games with the parachute. They are gathering the parachute but that doesn't necessarily mean they are going to repack it."}
{"0":"in one people are walking, in the other people are in cars","1":"if there are people walking under an arcade, there must be cars on the freeway","2":"in one people are walking, in the other people are in cars"}
{"0":"wearing and holding are different actions","1":"wearing and holding are different actions","2":"wearing and holding are different actions"}
{"0":"If there is a rag tag of the blue bus then there is a blue bus turning the corner.","1":"If there is a rag tag of the blue bus then there is a blue bus turning the corner.","2":"Just because there is a rag tag of the blue bus turning the corner does not mean it is true."}
